In [68]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('Bengaluru_House_Data.csv')

In [5]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [7]:
df.shape

(13320, 9)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [9]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [11]:
for column in df.columns:
    print(df[column].value_counts())
    print('*'*20)

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64
********************
availability
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: count, Length: 81, dtype: int64
********************
location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64
********************
size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64
********************
society
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: count, Length: 2688, dtype: int64
********************
total_sqft
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: count, Length: 2117, dtype: int64
********************
bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: count, dtype: int64
********************
balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64
********************
price
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: count, Length: 1994, dtype: int64
********************

In [15]:
df2 = df.drop(columns=['area_type','availability','balcony'])

In [16]:
df2.head()

                   location       size  society total_sqft  bath   price
0  Electronic City Phase II      2 BHK  Coomee        1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom  Theanmp       2600   5.0  120.00
2               Uttarahalli      3 BHK      NaN       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK  Soiewre       1521   3.0   95.00
4                  Kothanur      2 BHK      NaN       1200   2.0   51.00

In [17]:
df2.describe().T

         count        mean         std  min   25%   50%    75%     max
bath   13247.0    2.692610    1.341458  1.0   2.0   2.0    3.0    40.0
price  13320.0  112.565627  148.971674  8.0  50.0  72.0  120.0  3600.0

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   society     7818 non-null   object
 3   total_sqft  13320 non-null  object
 4   bath        13247 non-null  float64
 5   price       13320 non-null  float64
dtypes: float64(2), object(4)
memory usage: 624.5+ KB

In [20]:
df2.isnull().sum()

location         1
size            16
society       5502
total_sqft       0
bath            73
price            0
dtype: int64

In [19]:
df2['location'].value_counts()

location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64

In [21]:
df2['location'] = df2['location'].fillna('Sarjapur  Road')

In [22]:
df2.isnull().sum()

location         0
size            16
society       5502
total_sqft       0
bath            73
price            0
dtype: int64

In [24]:
df2['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [25]:
df2['size']=df2['size'].fillna('2 BHK')

In [26]:
df2['bath']=df2['bath'].fillna(df2['bath'].median())

In [27]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   society     7818 non-null   object
 3   total_sqft  13320 non-null  object
 4   bath        13320 non-null  float64
 5   price       13320 non-null  float64
dtypes: float64(2), object(4)
memory usage: 624.5+ KB

In [28]:
df2.head()

                   location       size  society total_sqft  bath   price
0  Electronic City Phase II      2 BHK  Coomee        1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom  Theanmp       2600   5.0  120.00
2               Uttarahalli      3 BHK      NaN       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK  Soiewre       1521   3.0   95.00
4                  Kothanur      2 BHK      NaN       1200   2.0   51.00

In [30]:
df2['bhk']=df2['size'].str.split().str.get(0).astype(int)

In [31]:
df2.head()

                   location       size  society total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK  Coomee        1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom  Theanmp       2600   5.0  120.00    4
2               Uttarahalli      3 BHK      NaN       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK  Soiewre       1521   3.0   95.00    3
4                  Kothanur      2 BHK      NaN       1200   2.0   51.00    2

In [32]:
df2[df2.bhk>20]

,location,size,society,total_sqft,bath,price,bhk
1718,2Electronic City Phase II,27 BHK,NaN,8000,27.0,230.0,27
4684,Munnekollal,43 Bedroom,NaN,2400,40.0,660.0,43

In [33]:
df2['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [38]:
def convertRange(x):
    temp=x.split('-')
    if len(temp)==2:
        return (float(temp[0])*float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [39]:
df2['total_sqft'] = df['total_sqft'].apply(convertRange)

In [40]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13320 non-null  object
 1   size        13320 non-null  object
 2   society     7818 non-null   object
 3   total_sqft  13274 non-null  float64
 4   bath        13320 non-null  float64
 5   price       13320 non-null  float64
 6   bhk         13320 non-null  int32
dtypes: float64(3), int32(1), object(3)
memory usage: 676.5+ KB

In [42]:
df2['price_per_sqft']=df2['price']*100000/df2['total_sqft']

In [44]:
df2.head()

,location,size,society,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,Coomee,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,Theanmp,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,NaN,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,Soiewre,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,NaN,1200.0,2.0,51.00,2,4250.000000

In [51]:
df2['loaction']=df2['location'].apply(lambda x:x.strip())
location_count=df2['location'].value_counts()

In [52]:
location_count_less_10=location_count[location_count<=10]
location_count_less_10

location
Kalkere                           10
Gunjur Palya                      10
Dodsworth Layout                  10
BTM 1st Stage                     10
Sadashiva Nagar                   10
                                  ..
Bapuji Layout                      1
1st Stage Radha Krishna Layout     1
BEML Layout 5th stage              1
singapura paradise                 1
Abshot Layout                      1
Name: count, Length: 1064, dtype: int64

In [53]:
df2.head()

,location,size,society,total_sqft,bath,price,bhk,price_per_sqft,loaction
0,Electronic City Phase II,2 BHK,Coomee,1056.0,2.0,39.07,2,3699.810606,Electronic City Phase II
1,Chikka Tirupathi,4 Bedroom,Theanmp,2600.0,5.0,120.00,4,4615.384615,Chikka Tirupathi
2,Uttarahalli,3 BHK,NaN,1440.0,2.0,62.00,3,4305.555556,Uttarahalli
3,Lingadheeranahalli,3 BHK,Soiewre,1521.0,3.0,95.00,3,6245.890861,Lingadheeranahalli
4,Kothanur,2 BHK,NaN,1200.0,2.0,51.00,2,4250.000000,Kothanur

In [56]:
df2['location']=df2['location'].apply(lambda x: 'other' if x in location_count_less_10 else x)

In [57]:
df2.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  1.327400e+04  13320.000000  13320.000000  13320.000000    1.327400e+04
mean   3.757339e+04      2.688814    112.565627      2.802778    7.829339e+03
std    4.748489e+05      1.338754    148.971674      1.294496    1.064333e+05
min    1.000000e+00      1.000000      8.000000      1.000000    1.180556e+00
25%    1.100000e+03      2.000000     50.000000      2.000000    4.210526e+03
50%    1.284000e+03      2.000000     72.000000      3.000000    5.412952e+03
75%    1.700000e+03      3.000000    120.000000      3.000000    7.288013e+03
max    1.606028e+07     40.000000   3600.000000     43.000000    1.200000e+07

In [60]:
(df2['total_sqft']/df2['bhk']).describe().T

count    1.327400e+04
mean     1.137245e+04
std      1.229315e+05
min      2.500000e-01
25%      4.750000e+02
50%      5.540000e+02
75%      6.280000e+02
max      4.015069e+06
dtype: float64

In [63]:
df2=df2[((df2['total_sqft']/df2['bhk'])>=300)]
df2.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  1.253000e+04  12530.000000  12530.000000  12530.000000    12530.000000
mean   3.974673e+04      2.559537    111.382401      2.650838     6221.175764
std    4.886582e+05      1.077938    152.077329      0.976678     4228.849601
min    3.000000e+02      1.000000      8.440000      1.000000        1.180556
25%    1.125000e+03      2.000000     49.000000      2.000000     4166.666667
50%    1.307500e+03      2.000000     70.000000      3.000000     5267.448444
75%    1.725000e+03      3.000000    115.000000      3.000000     6896.551724
max    1.606028e+07     16.000000   3600.000000     16.000000   176470.588235

In [65]:
df2.shape

(12530, 9)

In [66]:
df2.price_per_sqft.describe()

count     12530.000000
mean       6221.175764
std        4228.849601
min           1.180556
25%        4166.666667
50%        5267.448444
75%        6896.551724
max      176470.588235
Name: price_per_sqft, dtype: float64

In [73]:
def remove_outlier_sqft(df2):
    df_output=pd.DataFrame()
    for key,subdf in df2.groupby('location'):
        m=np.mean(subdf.price_per_sqft)
        st=np.std(subdf.price_per_sqft)
        
        gen_df=subdf[(subdf.price_per_sqft>(m-st))&(subdf.price_per_sqft<=(m+st))]
        df_output=pd.concat([df_output,gen_df],ignore_index=True)
    return df_output
df2=remove_outlier_sqft(df2)
df2.describe()

        total_sqft          bath         price           bhk  price_per_sqft
count  10427.00000  10427.000000  10427.000000  10427.000000    10427.000000
mean    1498.74495      2.468783     90.294388      2.571018     5633.910543
std      867.92764      0.970927     85.644841      0.892675     2272.354830
min      300.00000      1.000000      9.000000      1.000000     1250.000000
25%     1108.00000      2.000000     48.080000      2.000000     4199.862259
50%     1280.00000      2.000000     66.000000      2.000000     5147.058824
75%     1644.00000      3.000000    100.000000      3.000000     6423.670267
max    30400.00000     16.000000   2200.000000     16.000000    24509.803922

In [80]:
def bhk_outlier_remover(df2):
    exclude_indices=np.array([])
    for location,location_df in df2.groupby('location'):
        bhk_stats={}
        for bhk,bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk]={
                'mean':np.mean(bhk_df.price_per_sqft),
                'std':np.std(bhk_df.price_per_sqft),
                'count':bhk_df.shape[0]
            }
        for bhk,bhk_df in location_df.groupby('bhk'):
            stats=bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices=np.append(exclude_indices,bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df2.drop(exclude_indices,axis='index')

In [81]:
df2.head()

,location,size,society,total_sqft,bath,price,bhk,price_per_sqft,loaction
0,Devarachikkanahalli,3 BHK,NaN,1250.0,2.0,44.0,3,3520.000000,Devarachikkanahalli
1,Devarachikkanahalli,2 BHK,Clntsrt,1250.0,2.0,40.0,2,3200.000000,Devarachikkanahalli
2,Devarachikkanahalli,2 Bedroom,NaN,1200.0,2.0,83.0,2,6916.666667,Devarachikkanahalli
3,Devarachikkanahalli,2 BHK,NaN,1170.0,2.0,40.0,2,3418.803419,Devarachikkanahalli
4,Devarachikkanahalli,3 BHK,Shireru,1425.0,2.0,65.0,3,4561.403509,Devarachikkanahalli

In [82]:
df2=bhk_outlier_remover(df2)
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7442 entries, 1 to 10426
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   location        7442 non-null   object
 1   size            7442 non-null   object
 2   society         4838 non-null   object
 3   total_sqft      7442 non-null   float64
 4   bath            7442 non-null   float64
 5   price           7442 non-null   float64
 6   bhk             7442 non-null   int32
 7   price_per_sqft  7442 non-null   float64
 8   loaction        7442 non-null   object
dtypes: float64(4), int32(1), object(4)
memory usage: 552.3+ KB

In [83]:
df3 = df2.drop(columns=['size','price_per_sqft','society'],axis=1)

In [84]:
df3.head()

               location  total_sqft  bath  price  bhk             loaction
1   Devarachikkanahalli      1250.0   2.0   40.0    2  Devarachikkanahalli
2   Devarachikkanahalli      1200.0   2.0   83.0    2  Devarachikkanahalli
3   Devarachikkanahalli      1170.0   2.0   40.0    2  Devarachikkanahalli
4   Devarachikkanahalli      1425.0   2.0   65.0    3  Devarachikkanahalli
5   Devarachikkanahalli       947.0   2.0   43.0    2  Devarachikkanahalli

In [85]:
X = df3.iloc[:,[1,2,4]].values

In [86]:
y = df3['price']

In [89]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=42)

In [91]:
from sklearn.preprocessing import RobustScaler
scaler = RobustScaler()
X_train_scaled = scaler.fit_transform(X_train)
X_test_scaled = scaler.transform(X_test)

In [92]:
from sklearn.metrics import r2_score,mean_absolute_error, mean_squared_error
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestRegressor
from sklearn.tree import DecisionTreeRegressor


def evaluate_model(true,predict):
    r2 = r2_score(true,predict)
    mae = mean_absolute_error(true,predict)
    mse = mean_squared_error(true,predict)
    
    return r2,mae,mse

In [93]:
models = {
    'Linearregression':LinearRegression(),
    'DT':DecisionTreeRegressor(),
    'Randomforest':RandomForestRegressor()
}

In [94]:
for i in range(len(models)):
    model=list((models.values()))[i]
    print(model)

LinearRegression()
DecisionTreeRegressor()
RandomForestRegressor()

In [95]:
r2_list=[]
for i in range(len(models)):
    model=list(models.values())[i]
    
    model.fit(X_train_scaled,y_train)

    #make_prediction
    y_pred=model.predict(X_test_scaled)

    #this is for the validaiton
    R2,MAE,MSE=evaluate_model(y_test,y_pred)


    print("model training performance",model)
    print("MSE:", MSE)
    print("MAE:",MAE)
    print("R2 SCORE:",R2)
    
    r2_list.append(R2)

    print("="*40)
    print("\n")

D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):

model training performance LinearRegression()
MSE: 2404.28562083833
MAE: 25.329230961907797
R2 SCORE: 0.6708815314236611
========================================


model training performance DecisionTreeRegressor()
MSE: 3039.4958735146292
MAE: 25.098677146244235
R2 SCORE: 0.5839287069452126
========================================


model training performance RandomForestRegressor()
MSE: 2436.229989767174
MAE: 23.242593996689816
R2 SCORE: 0.666508722431927
========================================

D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:605: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype):
D:\Anaconda\Lib\site-packages\sklearn\utils\validation.py:614: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if is_sparse(pd_dtype) or not is_extension_array_dtype(pd_dtype):